// 1 януари 2019 – Нова година.
// 3 март – Ден на Освобождението на България от османско робство.
// 28 април – Великден – християнската религия отбелязва Възкресение Христово.
// 1 май – Ден на труда и на международната работническа солидарност.
// 6 май – Гергьовден, Ден на храбростта и Българската армия.
// 24 май – Денят на българската просвета и култура и на славянската писменост.
// 6 септември – Съединението на България.
// 22 септември – Ден на независимостта на България.
// 24, 25, 26 декември – Коледа.

let holidays = [
  '2019/01/01',
  '2019/03/03',
  '2019/05/01',
  '2019/05/06',
  '2019/05/24',
  '2019/09/06',
  '2019/09/22',
  '2019/12/24',
  '2019/12/25',
  '2019/12/26'
];

holidays = holidays.map(day => new Date(day));

export default holidays;
